---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowDataName
source: html/bea516ed-b6b3-a198-ee37-2fae2a1d3b56.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowDataName Property

If true, data name is shown in the legend.

## Syntax (C#)
```csharp
public bool ShowDataName { get; set; }
```